{
  "experiences": [
    {
      "company": "Therap (BD) Ltd.",
      "position": "Software Engineer II",
      "location": "Dhaka, Bangladesh",
      "duration": "Jun 2022 - Present",
      "responsibilities": [
        "Designed and implemented a history-based Aging Report Generation System using Java, Spring, MyBatis, and Oracle, improving A/R balance accuracy by 35%+ for 30,000+ healthcare providers.",
        "Led development of the Nebraska State Integration Billing Flow from scratch, enabling compliance with state-specific regulations and supporting 100% accurate claim submissions.",
        "Built and deployed RESTful APIs with Spring Web and Spring Data JDBC to integrate  external applications, reducing manual work and improving billing workflow efficiency by 30%.",
        "Optimized complex SQL queries, achieving a 50-60% reduction in execution time, significantly enhancing system responsiveness for billing operations.",
        "Refactored legacy codebases to leverage modern Java features (streams, optionals, lambdas), improving code maintainability and reducing defects by 15%.",
        "Supported onsite alpha deployments in QA environments, collaborating with U.S. stakeholders to ensure smooth rollouts and reducing post-deployment issues by 35%.",
        "Mentored 5+ junior engineers, conducting code reviews and knowledge-sharing sessions, increasing team productivity and reducing onboarding time by 20%."
      ]
    },
    {
      "company": "Freelance",
      "position": "Part-Time Game Developer",
      "location": "Remote",
      "duration": "Oct 2020 - Mar 2021",
      "responsibilities": [
        "Delivered a 3D hyper-casual game project on Upwork using C# and Unity Game Engine, meeting client requirements within deadline.",
        "Implemented a shortest-path visualizer in a 3D game using the A* search algorithm and Unity Line Renderer, enhancing gameplay mechanics for a Freelancer.com project.",
        "Designed and developed a 2D hyper-casual game for a local client using C# and Unity Game Engine, providing end-to-end development from concept to deployment."
      ]
    },
    {
      "company": "Freelance",
      "position": "Part-Time Front-End Developer",
      "location": "Remote",
      "duration": "Feb 2020 - May 2022",
      "responsibilities": [
        "Developed the front-end for an educational video streaming web application using Angular, Ionic, Cordova, and Bootstrap, ensuring a responsive and intuitive user interface across desktop and mobile devices.",
        "Collaborated with the project lead to design and implement user-friendly features, improving overall usability and enhancing the learning experience for end users."
      ]
    }
  ]
}

